[LANG]
language=Polish (Polska)
[FONT]
font-name=Segoe UI
welcome-text-size=62
home-text-size=22
home-section-size=24
analysis-text-size=20
analysis-section-size=22
left-panel-size=14
panel-list-size=16
panel-list-label-size=20
panel-list-header-size=16
panel-list-item-size=13
panel-button-size=12
combobox-size=16
list-combobox-size=16
checkbox-size=16
radio-size=15
elem-size=12
image-button-size=14
form-text-size=15
list-text-size=16
search-edit-size=16
message-text-size=16
setting-button-size=12
process-text-size=14
properites-title-font=18
properites-section-font=16
log-list-item-text-size=12
log-list-item-sql-size=14
[ERROR]
000000=
200001=Błąd składni SQL
200002=Plik nie istnieje
200003=Plik jest uszkodzony
200004=Błąd parametru
200026=Nazwa tabeli już istnieje
200027=Nazwa tabeli nie istnieje
200028=Błąd importu pliku CSV, nie udało się wygenerować SQL, sprawdź zawartość pliku CSV i konfigurację
300001=Nie wybrano kolumny tabeli do utworzenia indeksu
300002=Instrukcja SQL nie może być pusta
300003=Analiza SQL obsługuje tylko zapytania SELECT
[STRING]
home=Strona główna
database=Baza danych
analysis=Analiza
view=Widok
setting=Ustawienia
items=rekordów
tables=Tabele
views=Widoki
triggers=Wyzwalacze
columns=Kolumny
indexes=Indeksy
table=Tabela
clear-all=Wyczyść wszystko
yes=Tak
no=Nie
welcome-text=Witaj w CuteSqlite
home-text1=CuteSqlite to graficzne narzędzie klienckie (GUI) dla Sqlite3.
home-text2=Umożliwia projektowanie, tworzenie i przeglądanie baz danych, zarządzanie obiektami bazy danych,
home-text3=wstawianie danych oraz projektowanie i wykonywanie zapytań SQL w celu przetwarzania przechowywanych danych.
home-text4=Możesz także migrować bazę danych i dane od innych dostawców baz danych do bazy danych Sqlite.
db-section-text=Baza danych Sqlite
analysis-text1=CuteSqlite umożliwia analizę i optymalizację wydajności instrukcji SQL.
analysis-text2=Umożliwia także analizę pojemności pamięci każdej tabeli w bazie danych,
analysis-text3=oraz konfigurację parametrów bazy danych w celu jej optymalizacji.
perf-analysis-section-text=Analiza wydajności
error-text=Błąd systemu:
create-database=Utwórz nową bazę danych (Ctrl+N)
open-database=Otwórz bazę danych (Ctrl+O)
refresh-database=Odśwież bazę danych (F5)
delete-database=Usuń zaznaczoną bazę danych z listy (Del)
override-user-db=Dane usuniętego pliku nie mogą być odzyskane. Potwierdzić nadpisanie bazy danych?
create-db-success-text=Baza danych została pomyślnie utworzona
open-db-exists-inlist=Baza danych jest już otwarta, nie powtarzaj operacji
open-db-success-text=Baza danych została pomyślnie otwarta
delete-user-db=Potwierdzić usunięcie bazy danych "{dbName}" z listy?
delete-db-success-text=Baza danych została pomyślnie usunięta z listy
query-editor=Edytor zapytań
history=Historia
history-tip=Historia (F8)
result-list=Wyniki
result-info=Informacje
result-table-data=Dane tabeli
table-properties=Właściwości tabeli
exec-select-sql=Wykonaj zaznaczone zapytanie (F9)
exec-all-sql=Wykonaj wszystkie zapytania (F10)
explain-select-sql=Wyjaśnij (Explain) zaznaczoną instrukcję SQL (F11)
explain-query-plan-sql=Wyjaśnij plan zapytania (Explain query plan) zaznaczonej instrukcji SQL (F12)
query-page-help=Funkcja autouzupełniania: [Tab] -> następna karta; [Ctrl+Spacja] -> lista dopasowań; [Ctrl+Enter] -> lista wszystkich tagów
no-select-userdb=Nie wybrano bazy danych
no-sql-statement=Edytor zapytań nie zawiera żadnej instrukcji SQL
no-sql-content=Edytor zapytań nie zawiera treści SQL
show-form-view=Pokaż widok formularza
export-result-as=Eksportuj jako... (Ctrl+Alt+E)
copy-result-data=Kopiuj dane do schowka
clear-all=Wyczyść wszystko
ok=OK
cancel=Anuluj
export-text-description=Wybierz format eksportu danych
csv-settings=Opcje CSV
csv-field-settings=Kolumny
csv-line-settings=Wiersze
csv-charset-settings=Zestaw znaków
excel-settings=Opcje Excel
sql-settings=Opcje SQL
export-fields-settings=Wybierz kolumny do eksportu
terminated-by=Separator
enclosed-by=Ogranicznik
escaped-by=Znak ucieczki
field-terminated-by=Separator kolumn
field-enclosed-by=Ogranicznik kolumn
field-escaped-by=Znak ucieczki kolumn
line-terminated-by=Separator wierszy
add-column-name=Dodaj nazwy kolumn w nagłówku
csv-charset=Zestaw znaków
excel-column-max-size=Limit rozmiaru kolumny tekstowej
excel-decinmal-places=Miejsca dziesiętne
structure-only=Tylko struktura
data-only=Tylko dane
structure-and-data=Struktura i dane
select-all=Zaznacz wszystko
deselect-all=Odznacz wszystko
save-to-file=Zapisz do pliku
expert-fmt-error=Proszę wybrać format pliku do eksportu danych
terminated-by-error=Proszę wprowadzić wartość dla "Separator"
enclosed-by-error=Proszę wprowadzić wartość dla "Ogranicznik"
escaped-by-error=Proszę wprowadzić wartość dla "Znak ucieczki"
line-terminated-by-error=Wartość "Separator wierszy" jest nieprawidłowa
excel-column-max-size-error=Proszę wprowadzić wartość dla "Limit rozmiaru kolumny tekstowej"
excel-decinmal-places-error=Proszę wprowadzić wartość dla "Miejsca dziesiętne"
export-sql-error=Proszę wybrać opcje SQL
selected-fields-error=Proszę wybrać kolumny do eksportu
export-path-error=Proszę wprowadzić ścieżkę pliku eksportu
sql-notsupport-multitable-query-error=Eksport wyników zapytań wielotabelowych i podzapytań nie jest obsługiwany
export-success-text=Eksport zakończony sukcesem, wyeksportowano {rows} wierszy danych. Otworzyć plik?
open-the-file=Otwórz plik
export-file-exists-prompt={export-path} już istnieje. Zastąpić?
limit-rows=Limit wierszy
offset=Wiersz początkowy
rows=Liczba wierszy
copy-all-rows-to-clipboard=Kopiuj wszystkie wiersze do schowka Ctrl+Alt+A
copy-sel-rows-to-clipboard=Kopiuj zaznaczone wiersze do schowka Ctrl+Alt+H
copy-all-rows-as-sql=Kopiuj wszystkie wiersze jako SQL Ctrl+Alt+J
copy-sel-rows-as-sql=Kopiuj zaznaczone wiersze jako SQL Ctrl+Alt+K
read-only=Tylko do odczytu
filter=Filter (Ctrl+Alt+F)
filter-in-use=Filr w użyciu
refresh=Odśwież (Ctrl+F5)
refresh-page=Odśwież
new-row-tip=Nowy wiersz (Ctrl+Alt+N)
copy-row-tip=Kopiuj wiersz (Ctrl+Alt+C)
save-tip=Zapisz (Ctrl+Alt+S)
delete-tip=Usuń zaznaczony wiersz (Ctrl+Del)
cancel-tip=Cofnij zmiany (Ctrl+Alt+Z)
revert-tip=Przywróć
save=Zapisz
revert=Cofnij zmiany
column=Nazwa kolumny
condition=Warunek
value=Wartość
delete-confirm-text=Potwierdzić usunięcie zaznaczonych wierszy?
query=Zapytanie
result=Wynik
affected-rows=Dotknięte wiersze
exec-time=Czas wykonania
transfer-time=Czas transferu
total-time=Czas całkowity
database-create=Utwórz BD Ctrl+N
database-open=Otwórz BD Ctrl+O
database-refresh=Odśwież BD Ctrl+R
database-delete=Usuń BD Del
database-copy=Kopiuj BD jako... Ctrl+P
database-export-as-sql=Eksportuj BD do SQL Ctrl+E
database-import-from-sql=Importuj SQL do BD Ctrl+I
database-new=Utwórz
database-new-table=Tabelę
database-new-view=Widok
database-new-trigger=Wyzwalacz
export-as-sql-text-description=Eksportuj zaznaczone tabele/widoki/wyzwalacze BD jako SQL
select-database=Wybrana baza danych
database-objects=Obiekty
structure-and-data-settings=Ustawienia struktury i danych
insert-statement-settings=Ustawienia instrukcji INSERT
tbl-statement-settings=Ustawienia instrukcji tabeli
retain-column-text=Zachowaj nazwy kolumn w "Insert Into"
contain-multi-rows-text=Każda instrukcja "Insert" zawiera wiele wierszy (VALUES)
retain-table-text=Zachowaj starą tabelę (Create Table If Not Exists ...)
override-table-text=Nadpisz starą tabelę (DROP TABLE, następnie CREATE TABLE)
import-from-sql-text-description=Wsadowe wykonywanie instrukcji w pliku SQL.
abort-on-error-text=Zatrzymaj w przypadku błędu.
import-file-not-exists=Importowany plik SQL nie istnieje, wybierz ponownie.
import-path-empty-error=Ścieżka pliku importu nie może być pusta.
import=Importuj
export=Eksportuj
tbl-name=Nazwa tabeli
new-table=Utwórz tabelę
new-view=Utwórz widok
new-trigger=Utwórz wyzwalacz
database=Baza danych
schema=Schemat
table-columns=Kolumny
table-indexes=Indeksy
table-foreignkeys=Klucze obce
column-name=Nazwa kolumny
data-type=Typ danych
default=Domyślny
check=Sprawdź
index-name=Nazwa indeksu
index-type=Typ indeksu
index-unique=Unikalny
partial-clause=Klauzula częściowa
comments=Komentarze
to-be-selected=Dostępne kolumny
selected=Wybrane
up=▲
down=▼
no-columns-selected=Nie wybrano żadnej kolumny, proszę wybrać
sql-preview=Podgląd SQL
tbl-name-empty=Nazwa tabeli nie może być pusta
tbl-name-duplicated=Nazwa tabeli już istnieje
create-table-success-text=Tabela została pomyślnie utworzona.
alter-table-success-text=Tabela została pomyślnie zmodyfikowana.
rename-table-success-text=Nazwa tabeli została pomyślnie zmieniona.
delete-column-confirm-text=Wybrana kolumna jest referencjonowana przez jeden lub więcej indeksów. Usunięcie tej kolumny spowoduje również zmianę odpowiednich indeksów. Potwierdzić usunięcie?
delete-index-confirm-text=Wybrany indeks jest referencjonowany przez jedną lub więcej kolumn. Usunięcie tego indeksu spowoduje również zmianę odpowiednich kolumn. Potwierdzić usunięcie?
delete-confirm-text=Potwierdzić usunięcie?
new-view=Utwórz widok
new-trigger=Utwórz wyzwalacz
create-a-view-name=Nazwa nowego widoku
view-name-not-empty=Nazwa nowego widoku nie może być pusta
view-name-duplicated=Nazwa widoku już istnieje
create-a-trigger-name=Nazwa wyzwalacza
trigger-name-not-empty=Nazwa wyzwalacza nie może być pusta
trigger-name-duplicated=Nazwa wyzwalacza już istnieje
execute-sql-success=SQL zostało pomyślnie wykonane
copy-db-success-text=Baza danych została pomyślnie skopiowana
table-open=Otwórz dane tabeli Alt+O
table-create=Utwórz tabelę Alt+N
table-alter=Zmień tabelę Alt+A
table-rename=Zmień nazwę tabeli Alt+M
table-truncate=Wyczyść tabelę Alt+T
table-drop=Usuń tabelę Alt+Del
table-copy-as=Kopiuj tabelę do... Alt+P
table-sharding-as=Sharding Alt+G
table-export=Eksportuj tabelę do... Alt+E
table-import-sql=Importuj z pliku SQL Alt+I
table-import-csv=Importuj z pliku CSV Alt+J
table-manage-index=Zarządzaj indeksami tabeli
table-manage-foreign-key=Zarządzaj kluczami obcymi tabeli
properties=Właściwości
primary-key-duplicated=Klucz główny jest zdefiniowany wielokrotnie.
foreignkey-name=Nazwa klucza obcego
referencing-columns=Kolumny tej tabeli
referenced-table=Tabela referencjonowana
referenced-columns=Kolumny referencjonowane
on-update=Przy aktualizacji
on-delete=Przy usuwaniu
insert-new-column=Dodaj nową kolumnę
insert-new-index=Dodaj nowy indeks
insert-new-foreignkey=Dodaj nowy klucz obcy
insert-del-column=Usuń zaznaczoną kolumnę
insert-del-index=Usuń zaznaczony indeks
insert-del-foreignkey=Usuń zaznaczony klucz obcy
select-referenced-table-first=Najpierw wybierz tabelę referencjonowaną
new-table-name=Nowa nazwa tabeli
table-name-not-empty=Nowa nazwa tabeli nie może być pusta
table-name-duplicated=Nowa nazwa tabeli już istnieje
ai-column-exists=Kolumna AUTOINCREMENT już istnieje.
ai-fobidden-multi-pk=Kolumna AUTOINCREMENT już istnieje, wiele kolumn klucza głównego jest niedozwolone.
ai-column-must-integer=Kolumna AUTOINCREMENT musi być typu INTEGER.
truncate-table-confirm-text=Po wyczyszczeniu tabeli dane nie mogą być odzyskane. Potwierdzić czyszczenie?
truncate-table-success-text=Dane tabeli zostały pomyślnie wyczyszczone
drop-table-confirm-text=Po usunięciu tabeli dane nie mogą być odzyskane. Potwierdzić usunięcie?
drop-table-success-text=Tabela została pomyślnie usunięta
copy-table-text-description=Konfiguracja parametrów kopiowania, obsługuje sharding tabel
from-db-name=Źródłowa BD
from-tbl-name=Źródłowa tabela
to-db-name=Docelowa BD
to-tbl-name=Docelowa tabela
table-sharding-setttings=Sharding tabeli
enable-table-sharding=Włącz sharding tabeli
table-suffix-begin={suffix} Początkowa liczba całkowita
table-suffix-end={suffix} Końcowa liczba całkowita
advanced-settings=Zaawansowane opcje shardingu
enable-copy-data-with-strategy=Włącz strategię kopiowania danych do tabel shardowanych
sharding-strategy-express-text=Wyrażenie strategii shardingu: {n}
preview-sql=Podgląd instrukcji SQL
structure-and-data-settings-unknown=Nie wybrano ustawień struktury i danych
table-suffix-error=Nieprawidłowa liczba całkowita shardingu, podaj poprawną wartość
target-table-name-no-n=Tabela docelowa musi zawierać ciąg "{n}".
sharding-strategy-express-empty=Wyrażenie strategii shardingu nie może być puste
copy-table-success-text=Tabela została pomyślnie skopiowana.
start=Rozpocznij
complete=Zakończono
express-title=Wyrażenie strategii shardingu tabeli
functions=Funkcje
express-editor-help=Wyrażenie - kliknij dwukrotnie funkcję lub pole, aby wstawić do edytora
import-from-csv-text-description=Konfiguracja importu danych z pliku CSV
source-csv-file=Ścieżka źródłowego pliku CSV
target-database=Docelowa baza danych
target-table=Docelowa tabela
columns-setttings=Kolumny
csv-data=Dane CSV
column-name-on-top=Pierwszy wiersz jako nazwy kolumn
line-terminated-by=Separator wierszy
csv-null-as-keyword=null/NULL jako słowo kluczowe SQL
encoding=Zestaw znaków
import-success-text=Import zakończony sukcesem
incorrect-sql-statement=Nieprawidłowa instrukcja SQL
import-error-text=Błąd importu
table-manage-columns=Zarządzaj kolumnami
table-drop-column=Usuń kolumnę
table-manage-indexes=Zarządzaj indeksami
table-drop-index=Usuń indeks
create-view=Utwórz nowy widok
open-view=Otwórz widok
drop-view=Usuń widok
create-trigger=Utwórz wyzwalacz
open-trigger=Otwórz wyzwalacz
drop-trigger=Usuń wyzwalacz
drop-view-confirm-text=Po usunięciu widoku nie można go odzyskać. Potwierdzić usunięcie?
drop-view-success-text=Widok został pomyślnie usunięty
drop-trigger-confirm-text=Po usunięciu wyzwalacza nie można go odzyskać. Potwierdzić usunięcie?
drop-trigger-success-text=Wyzwalacz został pomyślnie usunięty
sql-templates=Szablony instrukcji SQL
pragma-templates=Pragmas
sql-log=Historia SQL
clear-all=Wyczyść wszystko
use=Użyj
explain=Wyjaśnij
top=Przypnij
untop=Odepnij
copy=Kopiuj
delete=Usuń
today=Dziś
yestoday=Wczoraj
delete-sql-log-confirm-text=Czy na pewno chcesz usunąć historię SQL?
copy-to-clipboard=Skopiowano do schowka
save-success-text=Zapisywanie zakończone sukcesem
delete-success-text=Usuwanie zakończone sukcesem
data-has-changed=Dane zostały zmienione. Czy na pewno chcesz zamknąć stronę?
not-save-and-close=Nie zapisuj, zamknij
cancel=Anuluj zamykanie
table-export-as=Eksportuj tabelę Alt+E
export-as-sql-success-text=Eksport zakończony sukcesem. Otworzyć plik?
new-query=Nowe okno zapytania (F7)
save-current=Zapisz bieżące (Ctrl+S)
save-all=Zapisz wszystko (Ctrl+Shift+S)
first-page=Pierwsza strona
prev-page=Poprzednia strona
next-page=Następna strona
last-page=Ostatnia strona
save-if-data-has-changed=Dane zostały zmienione. Zapisać przed zamknięciem?
unsort=Cofnij sortowanie
tab-close-this=Zamknij tę
tab-close-others=Zamknij pozostałe
tab-close-left=Zamknij wszystkie po lewej
tab-close-right=Zamknij wszystkie po prawej
perf-analysis=Analiza wydajności
perf-analysis-reports=Raporty z analizy
store-analysis=Analiza pamięci
db-params=Parametry BD
not-select-sql=Obsługiwane są tylko instrukcje SELECT
open-sql-log=Otwórz historię SQL do analizy wydajności (Ctrl+L)
add-sql-analysis=Wprowadź instrukcję SQL do analizy wydajności (Ctrl+I)
sql-log-not-found=Nie znaleziono historii SQL, sprawdź, czy nie została usunięta
original-sql=Oryginalna instrukcja SQL
where-clause-analysis=Analiza klauzuli WHERE
order-clause-analysis=Analiza klauzuli ORDER
covering-index-analysis=Analiza indeksów pokrywających
table-join-analysis=Analiza JOIN
in-table=Tabela danych
where-use-column=Klauzula WHERE używa kolumn
order-use-column=Klauzula ORDER używa kolumn
covering-index-column=Klauzule WHERE i ORDER używają kolumn
where-use-index=Klauzula WHERE używa indeksu
order-use-index=Klauzula ORDER używa indeksu
use-covering-index=Używa indeksu pokrywającego
create-index-for-performance=Zalecenie: utwórz indeks dla następujących kolumn, aby poprawić wydajność zapytań
hint-index-for-performance=Podpowiedź: indeks {hintIndexName} już pokrywa kolumny: {hintIndexColumns}
create-covering-index-for-performance=Zalecenie: utwórz indeks pokrywający dla następujących kolumn, aby poprawić wydajność zapytań
create-index-togeger=Utwórz indeks (razem)
create-index-individ=Utwórz indeksy (oddzielnie)
create-covering-index=Utwórz indeks pokrywający
explain-query-plan=Wyjaśnij plan zapytania
query-optimizer-pseudocode=Poniższy pseudokod pokazuje proces wykonywania optymalizatora zapytań
cycle-count=Statystyki cykli
optimize-cycle-count=Podpowiedź: zmiana kolejności łączenia tabel JOIN może zoptymalizować i zmniejszyć liczbę cykli.
general-settings=Ustawienia ogólne
about=O programie
language-setting=Ustawienie języka interfejsu
change-language-restart-text=Aby zmienić język, należy ponownie uruchomić oprogramowanie.
close-and-restart=Zamknij i uruchom ponownie
do-not-restart=Nie uruchamiaj ponownie
about-us=O nas
about-us-description=CuteSqlite to oprogramowanie open source opracowane przez autora Xuehan Qin.
version-info=Wersja
version-info-description=CuteSqlite v0.2.2 beta (64-bitowa)
feedback=Informacja zwrotna
feedback-description=Jeśli masz problemy z oprogramowaniem lub masz pomysły i sugestie dotyczące tej aplikacji, wypełnij poniższy formularz, aby przesłać nam opinię.
content-text=Treść
license=Licencja Apache wersja 2.0
select-columns-analysis=Analiza kolumn SELECT
select-use-column=Instrukcja SELECT używa następujących kolumn
select-use-column-count=Liczba kolumn
select-use-column-advice=Zalecenie: instrukcja SELECT wybiera więcej niż {maxColumns} kolumn. Zmniejszenie liczby kolumn może poprawić wydajność zapytań.
select-use-column-tips=Podpowiedź: zmniejszenie liczby kolumn może poprawić wydajność zapytań.
sql-perf-report-prefix=raport-wydajności-sql-
store-analysis-prefix=Analiza pamięci:
analysis-sql=Analiza SQL
open-perf-report=Otwórz raport Alt+O
drop-perf-report=Usuń raport Alt+Del
drop-perf-report-confirm-text=Potwierdzić usunięcie raportu?
store-analysis-text=Umożliwia analizę pojemności pamięci bazy danych, tabel i indeksów
table-store-analysis=Tabela - {tblName}
index-store-analysis=Indeks - {idxName} - Tabela: {tblName}
db-disk-used-title=Raport wykorzystania miejsca na dysku, ścieżka BD: {dbPath}
page-size-text=Rozmiar strony (w bajtach)
page-size-tips=Rozmiar strony (w bajtach)
file-bytes-text=Rozmiar pliku (w bajtach)
file-bytes-tips=Rozmiar pliku (w bajtach)
file-pgcnt-text=Liczba stron w całym pliku (zmierzona)
file-pgcnt-tips=Liczba stron w całym pliku (zmierzona)
file-pgcnt2-text=Liczba stron w całym pliku (obliczona)
file-pgcnt2-tips=Liczba stron w całym pliku (obliczona)
inuse-pgcnt-text=Liczba stron przechowujących dane (używane)
inuse-pgcnt-tips=Liczba stron przechowujących dane (używane)
free-pgcnt2-text=Liczba stron bez danych (według nagłówka)
free-pgcnt2-tips=Liczba stron bez danych (według nagłówka)
free-pgcnt-text=Liczba stron bez danych (obliczona)
free-pgcnt-tips=Liczba stron bez danych (obliczona)
av-pgcnt-text=Liczba automatycznie wyczyszczonych stron
av-pgcnt-tips=Liczba automatycznie wyczyszczonych stron
ntable-text=Liczba tabel w BD
ntable-tips=Liczba tabel w BD
nindex-text=Liczba indeksów
nindex-tips=Liczba indeksów
nmanindex-text=Liczba zdefiniowanych indeksów
nmanindex-tips=Liczba zdefiniowanych indeksów
nautoindex-text=Liczba indeksów niejawnych (auto-inkrementacja)
nautoindex-tips=Liczba indeksów niejawnych (auto-inkrementacja)
user-payload-text=Bajtów przechowywanego ładunku użytkownika
user-payload-tips=Bajtów przechowywanego ładunku użytkownika
all-tbl-entrycnt-title=Łączne dane wszystkich tabel (liczba rekordów)
all-tbl-idx-pagecnt-title=Liczba stron wszystkich tabel i ich indeksów
sperate-tbl-idx-pagecnt-title=Strony wszystkich tabel i indeksów liczone osobno
all-tbl-idx-report-title=Wszystkie tabele i indeksy
total-pages-percent-text=Procent całkowitej liczby stron BD
total-pages-percent-tips=Procent całkowitej liczby stron BD
nentry-title=Ilość danych (liczba rekordów)
nentry-tips=Ilość danych (liczba rekordów)
storage-text=Wykorzystane bajty pamięci
storage-tips=Wykorzystane bajty pamięci
compressed-size-text=Wykorzystane bajty po kompresji
compressed-size-tips=Wykorzystane bajty po kompresji
payload-text=Bajty ładunku
payload-tips=Bajty ładunku
total-meta-text=Bajty metadanych
total-meta-tips=Bajty metadanych
depth-text=Głębokość drzewa B
depth-tips=Głębokość drzewa B
avg-payload-text=Średni ładunek na rekord
avg-payload-tips=Średni ładunek na rekord
avg-unused-text=Średnia liczba niewykorzystanych bajtów na rekord
avg-unused-tips=Średnia liczba niewykorzystanych bajtów na rekord
avg-meta-text=Średnie metadane na rekord
avg-meta-tips=Średnie metadane na rekord
avg-fanout-text=Średni współczynnik rozgałęzienia
avg-fanout-tips=Średni współczynnik rozgałęzienia
gap-cnt-text=Strony nieciągłe
gap-cnt-tips=Strony nieciągłe
mx-payload-text=Maksymalny ładunek na rekord
mx-payload-tips=Maksymalny ładunek na rekord
ovfl-cnt-text=Liczba użytych rekordów nadmiarowych
ovfl-cnt-tips=Liczba użytych rekordów nadmiarowych
int-pages-text=Liczba użytych stron indeksów
int-pages-tips=Liczba użytych stron indeksów
leaf-pages-text=Liczba użytych stron liści
leaf-pages-tips=Liczba użytych stron liści
ovfl-pages-text=Liczba użytych stron nadmiarowych
ovfl-pages-tips=Liczba użytych stron nadmiarowych
total-pages-text=Łączna liczba użytych stron
total-pages-tips=Łączna liczba użytych stron
int-unused-text=Niewykorzystane bajty na stronach indeksów
int-unused-tips=Niewykorzystane bajty na stronach indeksów
leaf-unused-text=Niewykorzystane bajty na stronach liści
leaf-unused-tips=Niewykorzystane bajty na stronach liści
ovfl-unused-text=Niewykorzystane bajty na stronach nadmiarowych
ovfl-unused-tips=Niewykorzystane bajty na stronach nadmiarowych
total-unused-text=Niewykorzystane bajty na wszystkich stronach
total-unused-tips=Niewykorzystane bajty na wszystkich stronach
all-table-report-title=Wszystkie tabele (bez indeksów)
all-indices-report-title=Wszystkie indeksy (bez tabel)
tbl-and-all-idx-report-title=Tabela {tblName} i wszystkie jej indeksy
tbl-only-report-title=Tabela {tblName} (bez indeksów)
idx-only-report-title=Wszystkie indeksy tabeli {tblName}
tbl-report-title=Tabela {tblName}
idx-report-title=Indeks {idxName} tabeli {tblName}
props-tbl-only-report-title=Analiza pamięci tabeli {tblName}
props-idx-props-only-report-title=Wszystkie indeksy tabeli {tblName}
db-pragma-params=Parametry PRAGMA
db-quick-config-params=Szybkie opcje konfiguracyjne
select-pragma=PRAGMA
pragma-analysis-limit-tips=Zapytanie lub zmiana limitu ustawień analizy (ANALYZE). Jest to przybliżona liczba wierszy, którą polecenie ANALYZE sprawdza w każdym indeksie.
pragma-application-id-tips=Służy do zapytania lub ustawienia 32-bitowej liczby całkowitej ze znakiem "Application ID" w kolejności big-endian znajdującej się na przesunięciu 68 w nagłówku bazy danych.
pragma-auto-vacuum-tips=Zapytanie lub ustawienie stanu automatycznego czyszczenia (auto-vacuum) w bazie danych.
pragma-automatic-index-tips=Zapytanie, włączenie lub wyłączenie funkcji automatycznego indeksowania.
pragma-busy-timeout-tips=Zapytanie lub zmiana ustawienia limitu czasu oczekiwania (busy timeout).
pragma-cache-size-tips=Zapytanie lub zmiana maksymalnej liczby stron dysku bazy danych, które SQLite zaleca przechowywać w pamięci dla każdego otwartego pliku bazy danych.
pragma-cache-spill-tips=Włączenie lub wyłączenie możliwości programu stronicowania do zapisywania "brudnych" stron pamięci podręcznej do pliku bazy danych w środku transakcji.
pragma-case-sensitive-like-tips=Domyślne zachowanie operatora LIKE ignoruje wielkość liter w znakach ASCII. Dlatego domyślnie 'a' LIKE 'A' jest prawdziwe.
pragma-cell-size-check-tips=Włączenie lub wyłączenie dodatkowych kontroli integralności podczas odczytu stron drzewa B bazy danych z dysku. Gdy kontrola rozmiaru komórki jest włączona, uszkodzenie bazy danych może zostać wykryte wcześniej i jest mniej prawdopodobne, że się "rozprzestrzeni".
pragma-checkpoint-fullfsync-tips=Zapytanie lub zmiana flagi fullfsync dla operacji punktów kontrolnych (checkpoint). Jeśli ta flaga jest ustawiona, podczas operacji punktów kontrolnych w systemach obsługujących F_FULLFSYNC zostanie użyta metoda synchronizacji F_FULLFSYNC. Domyślna wartość flagi CHECKPOINT_FULLFSYNC to OFF. Tylko Mac OS-X obsługuje F_FULLFSYNC.
pragma-collation-list-tips=Zwraca listę sekwencji sortowania (collation) zdefiniowanych dla bieżącego połączenia z bazą danych.
pragma-compile-options-tips=Zwraca nazwy opcji czasu kompilacji użytych podczas budowania SQLite, jedną opcję na wiersz.
pragma-count-changes-tips=Zapytanie lub zmiana flagi zliczania zmian (count changes). Zazwyczaj, gdy flaga count-changes nie jest ustawiona, instrukcje INSERT, UPDATE i DELETE nie zwracają danych.
pragma-data-store-directory-tips=Zapytanie lub zmiana wartości zmiennej globalnej sqlite3_data_directory, używanej przez backend interfejsu systemu Windows do określania lokalizacji plików bazy danych określonych ścieżką względną.
pragma-data-version-tips=Wskazuje, że plik bazy danych został zmodyfikowany. Programy interaktywne, które przechowują zawartość bazy danych w pamięci lub wyświetlają ją na ekranie, mogą użyć polecenia PRAGMA data_version do określenia, czy muszą odświeżyć i ponownie załadować pamięć lub zaktualizować wyświetlanie na ekranie.
pragma-default-cache-size-tips=Zapytanie lub ustawienie zalecanej maksymalnej liczby stron pamięci podręcznej dysku, które zostaną przydzielone dla każdego otwartego pliku bazy danych.
pragma-defer-foreign-keys-tips=Nakazuje odroczenie wszystkich ograniczeń klucza obcego do czasu zatwierdzenia najbardziej zewnętrznej transakcji.
pragma-empty-result-callbacks-tips=Zapytanie lub zmiana flagi wywołania zwrotnego dla pustego wyniku.
pragma-encoding-tips=Kodowanie tekstu używane przez główną bazę danych: 'UTF-8', 'UTF-16le' (little-endian UTF-16) lub 'UTF-16be' (big-endian UTF-16).
pragma-foreign-key-check-tips=Sprawdza bazę danych lub tabelę pod kątem naruszeń ograniczeń klucza obcego.
pragma-foreign-keys-tips=Zapytanie, włączenie lub wyłączenie wymuszania ograniczeń klucza obcego.
pragma-freelist-count-tips=Zwraca liczbę nieużywanych stron w pliku bazy danych.
pragma-full-column-names-tips=Zapytanie lub zmiana flagi full_column_names.
pragma-fullfsync-tips=Zapytanie lub zmiana flagi fullfsync. Ta flaga określa, czy metoda synchronizacji F_FULLFSYNC będzie używana w systemach, które ją obsługują. Domyślna wartość fullfsync to OFF. Tylko Mac OS X obsługuje F_FULLFSYNC.
pragma-hard-heap-limit-tips=Ustawia limit ilości pamięci sterty (heap) dla wszystkich połączeń z bazą danych w jednym procesie.
pragma-ignore-check-constraints-tips=Włączenie lub wyłączenie wymuszania ograniczeń CHECK. Domyślne ustawienie to OFF, co oznacza, że ograniczenia CHECK są domyślnie wymuszane.
pragma-incremental-vacuum-tips=Powoduje usunięcie do N stron z listy wolnych stron (freelist).
pragma-integrity-check-tips=Przeprowadza niskopoziomowe sprawdzenie formatowania i spójności bazy danych.
pragma-journal-mode-tips=Zapytanie lub ustawienie trybu dziennika (journal mode) dla bazy danych powiązanej z bieżącym połączeniem.
pragma-journal-size-limit-tips=Ogranicza rozmiar plików dziennika wycofania (rollback journal) i WAL, które pozostają w systemie plików po transakcji lub punkcie kontrolnym.
pragma-legacy-alter-table-tips=Ustawia lub odczytuje wartość flagi legacy_alter_table.
pragma-locking-mode-tips=Ustawia lub odczytuje tryb blokowania (locking mode) połączenia z bazą danych. Tryby to NORMAL lub EXCLUSIVE.
pragma-max-page-count-tips=Zapytanie lub ustawienie maksymalnej liczby stron w pliku bazy danych.
pragma-mmap-size-tips=Zapytanie lub zmiana maksymalnej liczby bajtów zarezerwowanych dla wejścia/wyjścia mapowanego w pamięci (memory-mapped I/O) dla pojedynczej bazy danych.
pragma-module-list-tips=Zwraca listę modułów tabel wirtualnych zarejestrowanych w połączeniu z bazą danych.
pragma-optimize-tips=Próbuje zoptymalizować bazę danych.
pragma-page-count-tips=Zwraca całkowitą liczbę stron w pliku bazy danych.
pragma-page-size-tips=Zapytanie lub ustawienie rozmiaru strony bazy danych. Rozmiar strony musi być potęgą dwójki od 512 do 65536.
pragma-parser-trace-tips=Włącza śledzenie (trace) analizatora składniowego SQL używanego wewnętrznie przez SQLite. Działa tylko przy kompilacji z SQLITE_DEBUG.
pragma-query-only-tips=Uniemożliwia modyfikację danych w pliku bazy danych. Gdy ta opcja jest włączona, każda próba CREATE, UPDATE, DROP, INSERT lub UPDATE spowoduje błąd SQLITE_READONLY.
pragma-quick-check-tips=Przeprowadza niskopoziomowe sprawdzenie formatowania i spójności bazy danych, pomijając sprawdzenia spójności UNIQUE i indeksów.
pragma-read-uncommitted-tips=Zapytanie, włączenie lub wyłączenie poziomu izolacji READ UNCOMMITTED.
pragma-recursive-triggers-tips=Zapytanie, włączenie lub wyłączenie rekurencyjnego wykonywania wyzwalaczy.
pragma-reverse-unordered-selects-tips=Gdy jest włączona, ta pragma powoduje, że wiele zapytań SELECT bez klauzuli ORDER BY zwraca wyniki w odwrotnej niż zwykle kolejności.
pragma-schema-version-tips=Pobiera lub ustawia wartość całkowitą schema_version na przesunięciu 40 w nagłówku bazy danych.
pragma-secure-delete-tips=Zapytanie lub zmiana ustawienia bezpiecznego usuwania (secure-delete).
pragma-short-column-names-tips=Zapytanie lub zmiana flagi krótkich nazw kolumn.
pragma-soft-heap-limit-tips=Ogranicza ilość pamięci sterty używanej przez wszystkie połączenia z bazą danych w jednym procesie.
pragma-stats-tips=Zwraca pomocnicze informacje o tabelach i indeksach.
pragma-synchronous-tips=Zapytanie lub zmiana ustawienia flagi "synchronous".
pragma-temp-store-tips=Zapytanie lub zmiana wartości zmiennej globalnej sqlite3_temp_directory, używanej przez wiele backendów interfejsu systemu operacyjnego do określania lokalizacji przechowywania tymczasowych tabel i indeksów.
pragma-threads-tips=Liczba wątków pomocniczych uruchamianych przez przygotowaną instrukcję (prepared statement) do pomocy w zapytaniu.
pragma-trusted-schema-tips=Określa, czy dozwolone jest wykonywanie niebezpiecznych funkcji SQL i tabel wirtualnych w schemacie. Określa, czy widoki, wyzwalacze lub wyrażenia schematu (takie jak ograniczenia CHECK, klauzule DEFAULT, generowane kolumny, indeksy wyrażeń i/lub indeksy częściowe) mogą wykonywać niebezpieczne funkcje SQL i tabele wirtualne.
pragma-user-version-tips=Pobiera lub ustawia wartość całkowitą user_version na przesunięciu 60 w nagłówku bazy danych.
pragma-vdbe-addoptrace-tips=Pełne kody operacji VDBE są wyświetlane podczas generowania kodu. Działa, jeśli SQLite jest skompilowane z opcją SQLITE_DEBUG i włączony jest vdbe_debug.
pragma-vdbe-debug-tips=Włącza debugowanie VDBE. Działa, jeśli SQLite jest skompilowane z opcją SQLITE_DEBUG.
pragma-vdbe-listing-tips=Wyświetla pełną listę kodów operacji maszyny wirtualnej na standardowym wyjściu. Działa, jeśli SQLite jest skompilowane z opcją SQLITE_DEBUG i włączony jest vdbe_debug.
pragma-vdbe-trace-tips=Wypisuje kody operacji maszyny wirtualnej na standardowym wyjściu podczas obliczeń. Działa, jeśli SQLite jest skompilowane z opcją SQLITE_DEBUG i włączony jest vdbe_debug.
pragma-wal-autocheckpoint-tips=Zapytanie lub ustawienie interwału automatycznego punktu kontrolnego (auto-checkpoint) dla dziennika zapisu wyprzedzającego (write-ahead log).
pragma-wal-checkpoint-tips=Powoduje przeniesienie zawartości dziennika zapisu wyprzedzającego (write-ahead log) dla bazy danych X w połączeniu D do pliku bazy danych i zresetowanie dziennika zapisu wyprzedzającego.
pragma-writable-schema-tips=Umożliwia modyfikację tabeli sqlite_schema za pomocą zwykłych instrukcji UPDATE, INSERT i DELETE. Ostrzeżenie: nadużywanie tej pragmy może łatwo doprowadzić do uszkodzenia pliku bazy danych.
pragma-save-confirm=Instrukcja PRAGMA wpłynie na działanie bazy danych. Potwierdzić wykonanie poniższej instrukcji?
confirm-exec-text=Potwierdź i wykonaj